Revit 2027 API
IFCData.GetSimpleType Method
 Gets the IFC type name.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetSimpleType()
Public Function GetSimpleType As String
public:
String^ GetSimpleType()
member GetSimpleType : unit -> string
Return Value
String
 The name.
Exceptions
Exception | Condition
InvalidOperationException |  No type assigned or it is not a simple type.
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace